<br>
<font size="+2"> In this notebook, we will be working on questions in the Colab Notebooks section in Module 1. </font>
<br><br>

# Questions on Accessing Data



Let's take a break from learning basic pandas commands and have you practice what you've learned so far. To do this, we will work in this new Colab notebook.
<br><br>
In this notebook, you will read the `city_temperature.csv` datafile; the format of this datafile is the same as the temperature datafile we were using in the video, it just has many more data points because it includes temperature data for the entire world (i.e. rows).

In [6]:
pwd

'C:\\Users\\Cbilinski\\Desktop\\DataScienceStuff\\Classes\\edxMIT_UnderstandingtheWorldThroughData\\Modules\\Module1'

<font color='#FF4500' size="+2"> To set up your DataFrame for these questions, run the cell below. </font>

In [7]:
import pandas as pd
df2 = pd.read_csv("Data/city_temperature.csv")

C:\Users\Cbilinski\AppData\Local\Temp\ipykernel_6856\2726112131.py:2: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  df2 = pd.read_csv("Data/city_temperature.csv")

## Question 1

What's the name of the country at row number 1000000?

In [8]:
df2.loc[1000000]

Region                Europe
Country           Yugoslavia
State                    NaN
City                Belgrade
Month                      9
Day                        4
Year                    2005
AvgTemperature          64.8
Name: 1000000, dtype: object

## Question 2

What is the name of the city that comes last alphabetically?

In [11]:
df_sorted = df2.sort_values("City")

<bound method NDFrame.tail of         Region      Country State     City  Month  Day  Year  AvgTemperature
97950   Africa  Ivory Coast   NaN  Abidjan     12   22  1998            79.2
98614   Africa  Ivory Coast   NaN  Abidjan     10   16  2000            78.1
98615   Africa  Ivory Coast   NaN  Abidjan     10   17  2000            77.7
98616   Africa  Ivory Coast   NaN  Abidjan     10   18  2000            79.0
98617   Africa  Ivory Coast   NaN  Abidjan     10   19  2000            79.2
...        ...          ...   ...      ...    ...  ...   ...             ...
968114  Europe  Switzerland   NaN   Zurich     11    7  2019            41.3
968113  Europe  Switzerland   NaN   Zurich     11    6  2019            44.6
968112  Europe  Switzerland   NaN   Zurich     11    5  2019            46.5
968164  Europe  Switzerland   NaN   Zurich     12   27  2019            40.8
961942  Europe  Switzerland   NaN   Zurich     12   15  2002            39.3

[2906327 rows x 8 columns]>

In [18]:
df_sorted.tail(5)

        Region      Country State    City  Month  Day  Year  AvgTemperature
968114  Europe  Switzerland   NaN  Zurich     11    7  2019            41.3
968113  Europe  Switzerland   NaN  Zurich     11    6  2019            44.6
968112  Europe  Switzerland   NaN  Zurich     11    5  2019            46.5
968164  Europe  Switzerland   NaN  Zurich     12   27  2019            40.8
961942  Europe  Switzerland   NaN  Zurich     12   15  2002            39.3

## Question 3

How many data points are there in the US?

In [23]:
df2.loc[(df2['Country'] == 'US')]

,Region,Country,State,City,Month,Day,Year,AvgTemperature
1450990,North America,US,Alabama,Birmingham,1,1,1995,50.7
1450991,North America,US,Alabama,Birmingham,1,2,1995,37.2
1450992,North America,US,Alabama,Birmingham,1,3,1995,33.2
1450993,North America,US,Alabama,Birmingham,1,4,1995,33.3
1450994,North America,US,Alabama,Birmingham,1,5,1995,26.4
...,...,...,...,...,...,...,...,...
2906322,North America,US,Additional Territories,San Juan Puerto Rico,7,27,2013,82.4
2906323,North America,US,Additional Territories,San Juan Puerto Rico,7,28,2013,81.6
2906324,North America,US,Additional Territories,San Juan Puerto Rico,7,29,2013,84.2
2906325,North America,US,Additional Territories,San Juan Puerto Rico,7,30,2013,83.8
2906326,North America,US,Additional Territories,San Juan Puerto Rico,7,31,2013,83.6

## Question 4

What is the highest temperature in the dataset?

In [24]:
df2['AvgTemperature'].max()

110.0

## Question 5

What is the lowest temperature in the US? This dataset uses -99 as the temperature for missing values. Find the minimum temperature ignoring -99.

In [28]:
df2[df2['AvgTemperature'] != -99]['AvgTemperature'].min()

-50.0

## Question 6

What is the average August temperature in Beijing?

In [37]:
df2[(df2['City'] == 'Beijing') & (df2['Month'] == 8)]['AvgTemperature'].mean()

77.9541935483871

## Question 7

What is the city with the highest temperature?

In [40]:
df2[df2['AvgTemperature'] == df2['AvgTemperature'].max()]

              Region Country State    City  Month  Day  Year  AvgTemperature
1034962  Middle East  Kuwait   NaN  Kuwait      8    1  2012           110.0

## Question 8

In which year was the temperature in May the highest?

In [47]:
df2[(df2['AvgTemperature'] == df2[(df2['Month'] == 5)]['AvgTemperature'].max()) & (df2['Month'] == 5)]

              Region Country State    City  Month  Day  Year  AvgTemperature
1030148  Middle East  Kuwait   NaN  Kuwait      5   28  1999           104.9

In which city was the temperature in May the highest?

In [ ]:
# Your code here (hint: make use of the code from the previous question)